---
kind: property
id: P:Autodesk.Revit.DB.BoundarySegment.LinkElementId
source: html/ab09f25f-d5c6-942d-e0f6-8c27becbb53a.htm
---
# Autodesk.Revit.DB.BoundarySegment.LinkElementId Property

Retrieve the element id of the element in a link instance that forms this boundary.

## Syntax (C#)
```csharp
public ElementId LinkElementId { get; }
```